import model as md

model = md.Model(2, 1, 5)
model.simulate(1000, True)

# час створення заявки: зменшення
model = md.Model(1, 1, 5)       # збільшились: завантаження черги, ймовірність відмови, середня довжина черги, середній час очікування
model.simulate(1000, False)

# час створення заявки: збільшення
model = md.Model(4, 1, 5)       # зменшились: з.ч., йм.в., с.д.ч., с.ч.оч.
model.simulate(1000, False)

# час обслуговування заявки: зменшення
model = md.Model(2, 0.5, 5)     # зменшились: з.ч., йм.в., с.д.ч., с.ч.оч.
model.simulate(1000, False)

# час обслуговування заявки: збільшення
model = md.Model(2, 3, 5)       # збільшились: з.ч., йм.в., с.д.ч., с.ч.оч.
model.simulate(1000, False)

# максимальна довжина черги: зменшення
model = md.Model(2, 0.5, 2)     # зменшились: з.ч., йм.в., с.д.ч., с.ч.оч.
model.simulate(1000, False)

# максимальна довжина черги: збільшення
model = md.Model(2, 3, 10)      # збільшились: з.ч., йм.в., с.д.ч., с.ч.оч.
model.simulate(1000, False)
